Часть I – Простой прототип системы/ОсновноеПриложение1С/src/InformationRegisters/Фотографии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>Фотографии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Часть I – Простой прототип системы/ОсновноеПриложение1С/src/CommonForms/ПолучитьДанные/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьДанные(Команда)          
	
	ПолучитьДанныеНаСервереБезКонтекста();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеФото = Base64Значение(Элемент.ТекущиеДанные.Данные);
	Фото = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФото, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПолучитьДанныеНаСервереБезКонтекста()
	
	// Запрос данных с промежуточного сервера.
	Результат = КоннекторHTTP.GetJson("http://192.168.0.96:8000/get"); 
	
	Если ТипЗнч(Результат) = Тип("Соответствие") И Результат["status"] = "ok" Тогда
		
		// Массив данных хранится в поле "message".
		МассивДанных = Результат["message"];

		ДатаСобытия = ТекущаяДата();
		
		// Сохранение полученных данных.
		НаборЗаписей = РегистрыСведений.Фотографии.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДатаСобытия.Установить(ДатаСобытия);
			
		Для каждого Данные Из МассивДанных Цикл
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.ДатаСобытия	= ДатаСобытия;
			ЗаписьНабора.Идентификатор	= Данные["id"];
			ЗаписьНабора.Данные			= Данные["data"];
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
